In [11]:
import pandas as pd
path='datasets/car_data.csv'
df=pd.read_csv(path)

In [12]:
df.head()

   User ID Gender  Age  AnnualSalary  Purchased
0      385   Male   35         20000          0
1      681   Male   40         43500          0
2      353   Male   49         74000          0
3      895   Male   40        107500          1
4      661   Male   25         79000          0

In [18]:
df.shape

(1000, 5)

In [19]:
df.AnnualSalary.idxmax()

907

In [20]:
df.AnnualSalary.idxmin()

39

In [23]:
df.iloc[906]

User ID            505
Gender          Female
Age                 33
AnnualSalary     60000
Purchased            0
Name: 906, dtype: object

In [24]:
df.iloc[38]

User ID           121
Gender           Male
Age                42
AnnualSalary    73000
Purchased           1
Name: 38, dtype: object

In [25]:
df.isnull().any()

User ID         False
Gender          False
Age             False
AnnualSalary    False
Purchased       False
dtype: bool

In [26]:
df_dropped=df.drop('User ID', axis=1)

In [27]:
df_dropped

     Gender  Age  AnnualSalary  Purchased
0      Male   35         20000          0
1      Male   40         43500          0
2      Male   49         74000          0
3      Male   40        107500          1
4      Male   25         79000          0
..      ...  ...           ...        ...
995    Male   38         59000          0
996  Female   47         23500          0
997  Female   28        138500          1
998  Female   48        134000          1
999  Female   44         73500          0

[1000 rows x 4 columns]

In [32]:
from IPython.display import display
pd.set_option('display.max_columns',None)
pd.set_option('display.max_rows',None)